constant/chemistryProperties.kom
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    //solver            EulerImplicit;
    solver            ode;
}

chemistry           on;

initialChemicalTimeStep 1e-07;

/*EulerImplicitCoeffs // Эта версия от Маши
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

odeCoeffs 
{
    solver          Rosenbrock34;
    absTol          1e-12;
    relTol          0.01;
}*/

/*odeCoeffs // Эта версия из презентации
{
    ODESolver   SIBS;
    eps         5.0e-4;
    scale       1.0;
}*/

odeCoeffs
{
    solver          seulex;
    absTol          1e-8;
    relTol          1e-1;
}

#include "reactionsGRI"

// ************************************************************************* //
