constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

energySource
{
    type            semiImplicitSource;
    timeStart       1e-05;
    timeEnd         0.00119;
    timeEnd2        0.0012;
    power           5e+09;
    selectionMode   cellSet;
    cellSet         ignition;
    volumeMode      specific;
    sources
    {
        h
        {
            explicit        table ( ( 0 0 ) ( $timeStart $power ) ( $timeEnd $power ) ( $timeEnd2 0 ) );
            implicit        0;
        }
    }
}


// ************************************************************************* //
