constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    down
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          9625;
        startFace       421850;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          9625;
        startFace       431475;
    }
    cyl
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3300;
        startFace       441100;
    }
)

// ************************************************************************* //
