system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale           0.075;

H               -0.224;

algle45         0.707107;

algle_45        -0.707107;

gridScale       5;

radCellNumb     #calc "6*$gridScale";

perCellNumb     #calc "11*$gridScale";

zCellNumb       #calc "3*$gridScale";

izmel           1;

vertices        ( ( 0.45 -0.45 $H ) ( 0.45 0.45 $H ) ( -0.45 0.45 $H ) ( -0.45 -0.45 $H ) ( $algle45 $algle_45 $H ) ( $algle45 $algle45 $H ) ( $algle_45 $algle45 $H ) ( $algle_45 $algle_45 $H ) ( 0.45 -0.45 0 ) ( 0.45 0.45 0 ) ( -0.45 0.45 0 ) ( -0.45 -0.45 0 ) ( $algle45 $algle_45 0 ) ( $algle45 $algle45 0 ) ( $algle_45 $algle45 0 ) ( $algle_45 $algle_45 0 ) );

blocks          ( hex ( 5 1 0 4 13 9 8 12 ) AB ( $radCellNumb $perCellNumb $zCellNumb ) simpleGrading ( $izmel 1 1 ) hex ( 6 2 1 5 14 10 9 13 ) AB ( $radCellNumb $perCellNumb $zCellNumb ) simpleGrading ( $izmel 1 1 ) hex ( 7 3 2 6 15 11 10 14 ) AB ( $radCellNumb $perCellNumb $zCellNumb ) simpleGrading ( $izmel 1 1 ) hex ( 4 0 3 7 12 8 11 15 ) AB ( $radCellNumb $perCellNumb $zCellNumb ) simpleGrading ( $izmel 1 1 ) hex ( 0 1 2 3 8 9 10 11 ) AB ( $perCellNumb $perCellNumb $zCellNumb ) simpleGrading ( 1 1 1 ) );

edges           ( arc 0 1 ( 0.55 0 $H ) arc 1 2 ( 0 0.55 $H ) arc 2 3 ( -0.55 0 $H ) arc 3 0 ( 0 -0.55 $H ) arc 4 5 ( 1 0 $H ) arc 5 6 ( 0 1 $H ) arc 6 7 ( -1 0 $H ) arc 7 4 ( 0 -1 $H ) arc 8 9 ( 0.55 0 0 ) arc 9 10 ( 0 0.55 0 ) arc 10 11 ( -0.55 0 0 ) arc 11 8 ( 0 -0.55 0 ) arc 12 13 ( 1 0 0 ) arc 13 14 ( 0 1 0 ) arc 14 15 ( -1 0 0 ) arc 15 12 ( 0 -1 0 ) );

patches         ( wall down ( ( 1 5 4 0 ) ( 2 6 5 1 ) ( 3 7 6 2 ) ( 0 4 7 3 ) ( 3 2 1 0 ) ) wall top ( ( 13 9 8 12 ) ( 14 10 9 13 ) ( 15 11 10 14 ) ( 12 8 11 15 ) ( 8 9 10 11 ) ) wall cyl ( ( 4 5 13 12 ) ( 5 6 14 13 ) ( 6 7 15 14 ) ( 7 4 12 15 ) ) );


// ************************************************************************* //
