system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          1e-05;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc    probes
    #includeFunc    Qdot
    #includeFunc    fullEnthalphy
    integr
    {
        type            volFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    timeStep;
        writeInterval   1;
        log             true;
        writeFields     false;
        operation       volIntegrate;
        fields          ( rho rhoh rhoCH4 );
    }
    cylinder
    {
        type            volFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    timeStep;
        writeInterval   1;
        log             true;
        writeFields     false;
        operation       volAverage;
        fields          ( p T CH4 CO k omega );
    }
    spark
    {
        type            volFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    timeStep;
        log             true;
        writeFields     false;
        regionType      cellZone;
        name            ignition;
        operation       volAverage;
        fields          ( T CH4 );
    }
}


// ************************************************************************* //
