system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

points  (
    (0.015 0 -0.00336) 
    (0.030 0 -0.00672) 
    (0.045 0 -0.01008) 
    (0.060 0 -0.01344)
    );

fields  (p T);

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

// ************************************************************************* //
