system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue CH4 0.0549
    volScalarFieldValue N2 0.725824
);

regions
(
    // Setting values inside a box
    nearestToCell
    {
        points ( (0 0 0) );
        fieldValues
        (
            volScalarFieldValue CH4 0
            volScalarFieldValue N2 0.780724
        );
    }

);


// ************************************************************************* //
